// Сформируйте трёхмерный массив из неповторяющихся двузначных чисел. Напишите программу, которая будет построчно выводить массив, добавляя индексы каждого элемента.
Console.Clear();

void InputMatrix(int[,,] matrix)
{
    int number = 10;
    for (int i = 0; i < matrix.GetLength(0); i++)
    {
        for (int j = 0; j < matrix.GetLength(1); j++)
        {
            for (int k = 0; k <matrix.GetLength(2); k++)
            matrix[i, k, j] = number++;
        }
    }
}

void PrintMatrix(int[,,] matrix)
{
    for (int i = 0; i < matrix.GetLength(0); i++)
    {
        for (int j = 0; j < matrix.GetLength(1); j++)
        {
            for (int k = 0; k < matrix.GetLength(2); k++)
                Console.WriteLine($" {matrix[i, j, k]} ({i}, {j}, {k})");
        }
    }
}

Console.Write("Введите размер трехмерного массива: ");
int[] size = Console.ReadLine()!.Split().Select(x => int.Parse(x)).ToArray();

while (size[0] * size[1] * size[2] > 90)
{
    Console.Write("Вы ввели неверное значение");
    Console.Write("Введите размер трехмерного массива: ");
    size = Console.ReadLine().Split(" ").Select(x => int.Parse(x)).ToArray();
}

int[,,] matrix = new int[size[0], size[1], size [2]];
InputMatrix(matrix);
PrintMatrix(matrix);
